app/views/technicians/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."role" = 'regular'
SELECT "companies".* FROM "companies"
---
        <%= f.label :user , :class => 'control-label' %><div class="controls">
        <%=	select("technician", "user_id", User.where(:role => 'regular').collect {|p| [p.email , p.id] }) %>
        <%=	select("company", "company_id", Company.all.collect {|p| [p.name , p.id] }) %>