app/views/users/_form.html.erb

SELECT "companies".* FROM "companies"
---
    <% if current_user.role? :admin %>
        <%=	select("user", "company_id", Company.all.collect {|p| [p.name , p.id] }) %>