app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports" WHERE "reports"."user_id" = 2
---
  def index
    @reports = current_user.role == "admin" ? Report.all : Report.where(:user_id => current_user.id)