app/controllers/sessions_controller.rb

  def create
    resource = warden.authenticate!(:scope => resource_name, :recall => "#{controller_path}#new")
    set_flash_message(:notice, :signed_in) if is_navigational_format?
    sign_in(resource_name, resource)

    # current_user.reset_authentication_token!
    current_user.ensure_authentication_token
    current_user.save!
---
UPDATE "users" SET "last_sign_in_at" = '2014-12-03 19:24:27.564302', "current_sign_in_at" = '2014-12-03 19:24:27.564302', "last_sign_in_ip" = '66.165.176.62', "current_sign_in_ip" = '66.165.176.62', "sign_in_count" = 1, "updated_at" = '2014-12-03 19:24:27.566474' WHERE "users"."id" = 1