app/controllers/technicians_controller.rb

SELECT "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @technician = Technician.find(params[:id])

SELECT "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @technician = Technician.find(params[:id])

INSERT INTO "technicians" ("created_at", "email", "first_name", "last_name", "license", "license_expiration", "license_image_content_type", "license_image_file_name", "license_image_file_size", "license_image_updated_at", "phone", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."role" = 'regular'
INSERT INTO "users" ("active", "authentication_token", "company_id", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "password_salt", "phone", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @technician = Technician.create(params[:technician])
    if !(current_user.role? :admin)
      @technician.user_id = current_user.id;
    end

    if @technician.email == nil || @technician.license == nil
      respond_to do |format|
        format.html { render :action => "new" }
        format.json { render :json => "Invalid email or license", :status => :unprocessable_entity }
      end
    else
      user = User.new
      user.first_name = @technician.first_name
      user.last_name = @technician.last_name
      user.email = @technician.email
      user.password = @technician.license
      user.phone = @technician.phone

      respond_to do |format|
        if @technician.save && user.save

SELECT "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def update
    @technician = Technician.find(params[:id])

SELECT "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "technicians" WHERE "technicians"."id" = $1  [["id", 1]]
---
  def destroy
    @technician = Technician.find(params[:id])
    user = User.find(@technician.user_id)

    @technician.destroy