app/controllers/technicians_controller.rb

SELECT "technicians".* FROM "technicians" WHERE "technicians"."user_id" = 2
---
  def index
    @technicians = Technician.where(:user_id => current_user.id)