app/controllers/technicians_controller.rb

  def destroy
    @technician = Technician.find(params[:id])

    user = User.find_by_email(@technician.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'm@m.com' LIMIT 1