app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("active", "authentication_token", "company_id", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "password_salt", "phone", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"

  def destroy
    @user = User.find(params[:id])
    if (@user.role? :technician)
      tech = Technician.where(:email => @user.email).first
      if tech
        tech.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "technicians".* FROM "technicians" WHERE "technicians"."email" = 't@t.com' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]